In [1]:
import pandas as pd

A module that was compiled using NumPy 1.x cannot be run in
NumPy 2.0.2 as it may crash. To support both 1.x and 2.x
versions of NumPy, modules must be compiled with NumPy 2.0.
Some module may need to rebuild instead e.g. with 'pybind11>=2.12'.

If you are a user of the module, the easiest solution will be to
downgrade to 'numpy<2' or try to upgrade the affected module.
We expect that some modules will need time to support NumPy 2.

Traceback (most recent call last):  File "<frozen runpy>", line 198, in _run_module_as_main
  File "<frozen runpy>", line 88, in _run_code
  File "c:\Users\dipak\.conda\envs\env2\Lib\site-packages\ipykernel_launcher.py", line 18, in <module>
    app.launch_new_instance()
  File "c:\Users\dipak\.conda\envs\env2\Lib\site-packages\traitlets\config\application.py", line 1075, in launch_instance
    app.start()
  File "c:\Users\dipak\.conda\envs\env2\Lib\site-packages\ipykernel\kernelapp.py", line 739, in start
    self.io_loop.start()
  File "c:\Users\dipak\.conda\envs\env2\Lib\site-packages\tornado\platform\asyncio.py", line 205, in start
    self.asyncio_loop.run_forever()
  File "c:\Users\dipak\.conda\envs\env2\Lib\asyncio\base_events.py", line 641, in run_forever
    self._run_once()
  File "c:\Users\dipak\.conda\envs\env2\Lib\asyncio\base_events.py", line 1987, in _run_once
    handle._run()
  File "c:\Users\dipak\.conda\envs\env2\Lib\asyncio\events.py", line 88, in _run
    self._context.run(self._callback, *self._args)
  File "c:\Users\dipak\.conda\envs\env2\Lib\site-packages\ipykernel\kernelbase.py", line 545, in dispatch_queue
    await self.process_one()
  File "c:\Users\dipak\.conda\envs\env2\Lib\site-packages\ipykernel\kernelbase.py", line 534, in process_one
    await dispatch(*args)
  File "c:\Users\dipak\.conda\envs\env2\Lib\site-packages\ipykernel\kernelbase.py", line 437, in dispatch_shell
    await result
  File "c:\Users\dipak\.conda\envs\env2\Lib\site-packages\ipykernel\ipkernel.py", line 362, in execute_request
    await super().execute_request(stream, ident, parent)
  File "c:\Users\dipak\.conda\envs\env2\Lib\site-packages\ipykernel\kernelbase.py", line 778, in execute_request
    reply_content = await reply_content
  File "c:\Users\dipak\.conda\envs\env2\Lib\site-packages\ipykernel\ipkernel.py", line 449, in do_execute
    res = shell.run_cell(
  File "c:\Users\dipak\.conda\envs\env2\Lib\site-packages\ipykernel\zmqshell.py", line 549, in run_cell
    return super().run_cell(*args, **kwargs)
  File "c:\Users\dipak\.conda\envs\env2\Lib\site-packages\IPython\core\interactiveshell.py", line 3075, in run_cell
    result = self._run_cell(
  File "c:\Users\dipak\.conda\envs\env2\Lib\site-packages\IPython\core\interactiveshell.py", line 3130, in _run_cell
    result = runner(coro)
  File "c:\Users\dipak\.conda\envs\env2\Lib\site-packages\IPython\core\async_helpers.py", line 128, in _pseudo_sync_runner
    coro.send(None)
  File "c:\Users\dipak\.conda\envs\env2\Lib\site-packages\IPython\core\interactiveshell.py", line 3334, in run_cell_async
    has_raised = await self.run_ast_nodes(code_ast.body, cell_name,
  File "c:\Users\dipak\.conda\envs\env2\Lib\site-packages\IPython\core\interactiveshell.py", line 3517, in run_ast_nodes
    if await self.run_code(code, result, async_=asy):
  File "c:\Users\dipak\.conda\envs\env2\Lib\site-packages\IPython\core\interactiveshell.py", line 3577, in run_code
    exec(code_obj, self.user_global_ns, self.user_ns)
  File "C:\Users\dipak\AppData\Local\Temp\ipykernel_28184\4080736814.py", line 1, in <module>
    import pandas as pd
  File "c:\Users\dipak\.conda\envs\env2\Lib\site-packages\pandas\__init__.py", line 62, in <module>
    from pandas.core.api import (
  File "c:\Users\dipak\.conda\envs\env2\Lib\site-packages\pandas\core\api.py", line 28, in <module>
    from pandas.core.arrays import Categorical
  File "c:\Users\dipak\.conda\envs\env2\Lib\site-packages\pandas\core\arrays\__init__.py", line 1, in <module>
    from pandas.core.arrays.arrow import ArrowExtensionArray
  File "c:\Users\dipak\.conda\envs\env2\Lib\site-packages\pandas\core\arrays\arrow\__init__.py", line 5, in <module>
    from pandas.core.arrays.arrow.array import ArrowExtensionArray
  File "c:\Users\dipak\.conda\envs\env2\Lib\site-packages\pandas\core\arrays\arrow\array.py", line 50, in <module>
    from pandas.core import (
  File "c:\Users\dipak\.conda\envs\env2\Lib\site-packages\pandas\core\ops\__init__.py", line 8, in <module>
    from pandas.core.ops.array_ops import (
  File "c:\Users\dipak\.conda\envs\env2\Lib\site-packages\pandas\core\ops\array_ops.py", line 56, in <module>
    from pandas.core.computation import expressions
  File "c:\Users\dipak\.conda\envs\env2\Lib\site-packages\pandas\core\computation\expressions.py", line 21, in <module>
    from pandas.core.computation.check import NUMEXPR_INSTALLED
  File "c:\Users\dipak\.conda\envs\env2\Lib\site-packages\pandas\core\computation\check.py", line 5, in <module>
    ne = import_optional_dependency("numexpr", errors="warn")
  File "c:\Users\dipak\.conda\envs\env2\Lib\site-packages\pandas\compat\_optional.py", line 135, in import_optional_dependency
    module = importlib.import_module(name)
  File "c:\Users\dipak\.conda\envs\env2\Lib\importlib\__init__.py", line 90, in import_module
    return _bootstrap._gcd_import(name[level:], package, level)
  File "c:\Users\dipak\.conda\envs\env2\Lib\site-packages\numexpr\__init__.py", line 24, in <module>
    from numexpr.interpreter import MAX_THREADS, use_vml, __BLOCK_SIZE1__

AttributeError: _ARRAY_API not found

A module that was compiled using NumPy 1.x cannot be run in
NumPy 2.0.2 as it may crash. To support both 1.x and 2.x
versions of NumPy, modules must be compiled with NumPy 2.0.
Some module may need to rebuild instead e.g. with 'pybind11>=2.12'.

If you are a user of the module, the easiest solution will be to
downgrade to 'numpy<2' or try to upgrade the affected module.
We expect that some modules will need time to support NumPy 2.

Traceback (most recent call last):  File "<frozen runpy>", line 198, in _run_module_as_main
  File "<frozen runpy>", line 88, in _run_code
  File "c:\Users\dipak\.conda\envs\env2\Lib\site-packages\ipykernel_launcher.py", line 18, in <module>
    app.launch_new_instance()
  File "c:\Users\dipak\.conda\envs\env2\Lib\site-packages\traitlets\config\application.py", line 1075, in launch_instance
    app.start()
  File "c:\Users\dipak\.conda\envs\env2\Lib\site-packages\ipykernel\kernelapp.py", line 739, in start
    self.io_loop.start()
  File "c:\Users\dipak\.conda\envs\env2\Lib\site-packages\tornado\platform\asyncio.py", line 205, in start
    self.asyncio_loop.run_forever()
  File "c:\Users\dipak\.conda\envs\env2\Lib\asyncio\base_events.py", line 641, in run_forever
    self._run_once()
  File "c:\Users\dipak\.conda\envs\env2\Lib\asyncio\base_events.py", line 1987, in _run_once
    handle._run()
  File "c:\Users\dipak\.conda\envs\env2\Lib\asyncio\events.py", line 88, in _run
    self._context.run(self._callback, *self._args)
  File "c:\Users\dipak\.conda\envs\env2\Lib\site-packages\ipykernel\kernelbase.py", line 545, in dispatch_queue
    await self.process_one()
  File "c:\Users\dipak\.conda\envs\env2\Lib\site-packages\ipykernel\kernelbase.py", line 534, in process_one
    await dispatch(*args)
  File "c:\Users\dipak\.conda\envs\env2\Lib\site-packages\ipykernel\kernelbase.py", line 437, in dispatch_shell
    await result
  File "c:\Users\dipak\.conda\envs\env2\Lib\site-packages\ipykernel\ipkernel.py", line 362, in execute_request
    await super().execute_request(stream, ident, parent)
  File "c:\Users\dipak\.conda\envs\env2\Lib\site-packages\ipykernel\kernelbase.py", line 778, in execute_request
    reply_content = await reply_content
  File "c:\Users\dipak\.conda\envs\env2\Lib\site-packages\ipykernel\ipkernel.py", line 449, in do_execute
    res = shell.run_cell(
  File "c:\Users\dipak\.conda\envs\env2\Lib\site-packages\ipykernel\zmqshell.py", line 549, in run_cell
    return super().run_cell(*args, **kwargs)
  File "c:\Users\dipak\.conda\envs\env2\Lib\site-packages\IPython\core\interactiveshell.py", line 3075, in run_cell
    result = self._run_cell(
  File "c:\Users\dipak\.conda\envs\env2\Lib\site-packages\IPython\core\interactiveshell.py", line 3130, in _run_cell
    result = runner(coro)
  File "c:\Users\dipak\.conda\envs\env2\Lib\site-packages\IPython\core\async_helpers.py", line 128, in _pseudo_sync_runner
    coro.send(None)
  File "c:\Users\dipak\.conda\envs\env2\Lib\site-packages\IPython\core\interactiveshell.py", line 3334, in run_cell_async
    has_raised = await self.run_ast_nodes(code_ast.body, cell_name,
  File "c:\Users\dipak\.conda\envs\env2\Lib\site-packages\IPython\core\interactiveshell.py", line 3517, in run_ast_nodes
    if await self.run_code(code, result, async_=asy):
  File "c:\Users\dipak\.conda\envs\env2\Lib\site-packages\IPython\core\interactiveshell.py", line 3577, in run_code
    exec(code_obj, self.user_global_ns, self.user_ns)
  File "C:\Users\dipak\AppData\Local\Temp\ipykernel_28184\4080736814.py", line 1, in <module>
    import pandas as pd
  File "c:\Users\dipak\.conda\envs\env2\Lib\site-packages\pandas\__init__.py", line 62, in <module>
    from pandas.core.api import (
  File "c:\Users\dipak\.conda\envs\env2\Lib\site-packages\pandas\core\api.py", line 28, in <module>
    from pandas.core.arrays import Categorical
  File "c:\Users\dipak\.conda\envs\env2\Lib\site-packages\pandas\core\arrays\__init__.py", line 1, in <module>
    from pandas.core.arrays.arrow import ArrowExtensionArray
  File "c:\Users\dipak\.conda\envs\env2\Lib\site-packages\pandas\core\arrays\arrow\__init__.py", line 5, in <module>
    from pandas.core.arrays.arrow.array import ArrowExtensionArray
  File "c:\Users\dipak\.conda\envs\env2\Lib\site-packages\pandas\core\arrays\arrow\array.py", line 64, in <module>
    from pandas.core.arrays.masked import BaseMaskedArray
  File "c:\Users\dipak\.conda\envs\env2\Lib\site-packages\pandas\core\arrays\masked.py", line 60, in <module>
    from pandas.core import (
  File "c:\Users\dipak\.conda\envs\env2\Lib\site-packages\pandas\core\nanops.py", line 52, in <module>
    bn = import_optional_dependency("bottleneck", errors="warn")
  File "c:\Users\dipak\.conda\envs\env2\Lib\site-packages\pandas\compat\_optional.py", line 135, in import_optional_dependency
    module = importlib.import_module(name)
  File "c:\Users\dipak\.conda\envs\env2\Lib\importlib\__init__.py", line 90, in import_module
    return _bootstrap._gcd_import(name[level:], package, level)
  File "c:\Users\dipak\.conda\envs\env2\Lib\site-packages\bottleneck\__init__.py", line 7, in <module>
    from .move import (move_argmax, move_argmin, move_max, move_mean, move_median,

ImportError:
A module that was compiled using NumPy 1.x cannot be run in
NumPy 2.0.2 as it may crash. To support both 1.x and 2.x
versions of NumPy, modules must be compiled with NumPy 2.0.
Some module may need to rebuild instead e.g. with 'pybind11>=2.12'.

If you are a user of the module, the easiest solution will be to
downgrade to 'numpy<2' or try to upgrade the affected module.
We expect that some modules will need time to support NumPy 2.

In [2]:
data1 = {'Name':['Jai', 'Anuj', 'Jai', 'Princi',
                 'Gaurav', 'Anuj', 'Princi', 'Abhi'],
        'Age':[27, 24, 22, 32,
               33, 36, 27, 32],
        'Address':['Nagpur', 'Kanpur', 'Allahabad', 'Kannuaj',
                   'Jaunpur', 'Kanpur', 'Allahabad', 'Aligarh'],
        'Qualification':['Msc', 'MA', 'MCA', 'Phd',
                         'B.Tech', 'B.com', 'Msc', 'MA']}

In [3]:
df = pd.DataFrame(data1)

In [5]:
df.groupby("Name").groups

{'Abhi': [7], 'Anuj': [1, 5], 'Gaurav': [4], 'Jai': [0, 2], 'Princi': [3, 6]}

In [6]:
gk = df.groupby("Name")

In [7]:
gk.first()

        Age  Address Qualification
Name
Abhi     32  Aligarh            MA
Anuj     24   Kanpur            MA
Gaurav   33  Jaunpur        B.Tech
Jai      27   Nagpur           Msc
Princi   32  Kannuaj           Phd

In [8]:
# Grouping data with multiple keys

In [ ]:
df.groupby(["Name","Age"]).groups

In [15]:
# Group by name and get the sum of age

In [21]:
df.groupby(["Name"], sort=False)["Age"].sum()

Name
Jai       49
Anuj      60
Princi    59
Gaurav    33
Abhi      32
Name: Age, dtype: int64

In [22]:
# iterating through groups

In [ ]:
grp = df.groupby(["Name"])

for name, group in grp:
    print(f"name: {name}")

print()
print()

for name, group in grp:
    print(f"{group}")

name: ('Abhi',)
name: ('Anuj',)
name: ('Gaurav',)
name: ('Jai',)
name: ('Princi',)


   Name  Age  Address Qualification
7  Abhi   32  Aligarh            MA
   Name  Age Address Qualification
1  Anuj   24  Kanpur            MA
5  Anuj   36  Kanpur         B.com
     Name  Age  Address Qualification
4  Gaurav   33  Jaunpur        B.Tech
  Name  Age    Address Qualification
0  Jai   27     Nagpur           Msc
2  Jai   22  Allahabad           MCA
     Name  Age    Address Qualification
3  Princi   32    Kannuaj           Phd
6  Princi   27  Allahabad           Msc
<pandas.core.groupby.generic.DataFrameGroupBy object at 0x000002917F41CE60>

In [32]:
# iteratae the group with the element containing the multiples keys

In [47]:
grouping = df.groupby(["Name","Qualification"])

In [48]:
for name, group in grouping:
    # print(name)
    print(group)
    print()
    print()

   Name  Age  Address Qualification
7  Abhi   32  Aligarh            MA


   Name  Age Address Qualification
5  Anuj   36  Kanpur         B.com


   Name  Age Address Qualification
1  Anuj   24  Kanpur            MA


     Name  Age  Address Qualification
4  Gaurav   33  Jaunpur        B.Tech


  Name  Age    Address Qualification
2  Jai   22  Allahabad           MCA


  Name  Age Address Qualification
0  Jai   27  Nagpur           Msc


     Name  Age    Address Qualification
6  Princi   27  Allahabad           Msc


     Name  Age  Address Qualification
3  Princi   32  Kannuaj           Phd

In [49]:
grp = df.groupby("Name")

In [50]:
grp.get_group("Jai")

  Name  Age    Address Qualification
0  Jai   27     Nagpur           Msc
2  Jai   22  Allahabad           MCA

In [51]:
grp = df.groupby(["Name","Qualification"])

In [52]:
grp.get_group(("Jai","Msc"))

  Name  Age Address Qualification
0  Jai   27  Nagpur           Msc

In [53]:
grouping.get_group(("Jai","Msc"))

  Name  Age Address Qualification
0  Jai   27  Nagpur           Msc

In [54]:
import numpy as np

In [55]:
# Applying the functions

In [56]:
# for single grouping
datas = df.groupby(["Name"])

datas.aggregate([np.sum])

C:\Users\dipak\AppData\Local\Temp\ipykernel_28184\1980658867.py:4: FutureWarning: The provided callable <function sum at 0x000002917E2087C0> is currently using SeriesGroupBy.sum. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "sum" instead.
  datas.aggregate([np.sum])
C:\Users\dipak\AppData\Local\Temp\ipykernel_28184\1980658867.py:4: FutureWarning: The provided callable <function sum at 0x000002917E2087C0> is currently using SeriesGroupBy.sum. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "sum" instead.
  datas.aggregate([np.sum])

       Age           Address Qualification
       sum               sum           sum
Name
Abhi    32           Aligarh            MA
Anuj    60      KanpurKanpur       MAB.com
Gaurav  33           Jaunpur        B.Tech
Jai     49   NagpurAllahabad        MscMCA
Princi  59  KannuajAllahabad        PhdMsc

In [ ]:
# for grouping with multiples with keys

new_datas = df.groupby(["Name","Qualification"])

new_datas.aggregate([np.sum])

C:\Users\dipak\AppData\Local\Temp\ipykernel_28184\4012429001.py:5: FutureWarning: The provided callable <function sum at 0x000002917E2087C0> is currently using SeriesGroupBy.sum. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "sum" instead.
  new_datas.aggregate([np.sum])
C:\Users\dipak\AppData\Local\Temp\ipykernel_28184\4012429001.py:5: FutureWarning: The provided callable <function sum at 0x000002917E2087C0> is currently using SeriesGroupBy.sum. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "sum" instead.
  new_datas.aggregate([np.sum])
C:\Users\dipak\AppData\Local\Temp\ipykernel_28184\4012429001.py:8: FutureWarning: The provided callable <function sum at 0x000002917E2087C0> is currently using SeriesGroupBy.sum. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "sum" instead.
  datas["Age"].aggregate([np.sum, np.average, np.std])
C:\Users\dipak\AppData\Local\Temp\ipykernel_28184\4012429001.py:8: FutureWarning: The provided callable <function std at 0x000002917E2099E0> is currently using SeriesGroupBy.std. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "std" instead.
  datas["Age"].aggregate([np.sum, np.average, np.std])

        sum  average       std
Name
Abhi     32     32.0       NaN
Anuj     60     30.0  8.485281
Gaurav   33     33.0       NaN
Jai      49     24.5  3.535534
Princi   59     29.5  3.535534

In [69]:
# apply multiples function at once
datas["Age"].aggregate([np.sum, np.average, np.std])

C:\Users\dipak\AppData\Local\Temp\ipykernel_28184\736493095.py:2: FutureWarning: The provided callable <function sum at 0x000002917E2087C0> is currently using SeriesGroupBy.sum. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "sum" instead.
  datas["Age"].aggregate([np.sum, np.average, np.std])
C:\Users\dipak\AppData\Local\Temp\ipykernel_28184\736493095.py:2: FutureWarning: The provided callable <function std at 0x000002917E2099E0> is currently using SeriesGroupBy.std. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "std" instead.
  datas["Age"].aggregate([np.sum, np.average, np.std])

        sum  average       std
Name
Abhi     32     32.0       NaN
Anuj     60     30.0  8.485281
Gaurav   33     33.0       NaN
Jai      49     24.5  3.535534
Princi   59     29.5  3.535534

In [70]:
# for multiple keys and multiple functions
new_datas["Age"].aggregate([np.sum, np.average, np.std])

C:\Users\dipak\AppData\Local\Temp\ipykernel_28184\2020250928.py:2: FutureWarning: The provided callable <function sum at 0x000002917E2087C0> is currently using SeriesGroupBy.sum. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "sum" instead.
  new_datas["Age"].aggregate([np.sum, np.average, np.std])
C:\Users\dipak\AppData\Local\Temp\ipykernel_28184\2020250928.py:2: FutureWarning: The provided callable <function std at 0x000002917E2099E0> is currently using SeriesGroupBy.std. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "std" instead.
  new_datas["Age"].aggregate([np.sum, np.average, np.std])

                      sum  average  std
Name   Qualification
Abhi   MA              32     32.0  NaN
Anuj   B.com           36     36.0  NaN
       MA              24     24.0  NaN
Gaurav B.Tech          33     33.0  NaN
Jai    MCA             22     22.0  NaN
       Msc             27     27.0  NaN
Princi Msc             27     27.0  NaN
       Phd             32     32.0  NaN

In [71]:
# Now working with transformations

In [74]:
df2 = pd.DataFrame(data1)

In [75]:
grp2 = df2.groupby(["Name"])

In [78]:
grp2.groups

{'Abhi': [7], 'Anuj': [1, 5], 'Gaurav': [4], 'Jai': [0, 2], 'Princi': [3, 6]}

In [79]:
sc = lambda x : (x - x.mean())/x.std()

grp2['Age'].transform(sc)

0    0.707107
1   -0.707107
2   -0.707107
3    0.707107
4         NaN
5    0.707107
6   -0.707107
7         NaN
Name: Age, dtype: float64

In [85]:
# Filterations

# Its a process used to discard the group based on a conditions

grp2 = df2.groupby(["Name"])

grp2.filter(lambda x: len(x) >= 2)

     Name  Age    Address Qualification
0     Jai   27     Nagpur           Msc
1    Anuj   24     Kanpur            MA
2     Jai   22  Allahabad           MCA
3  Princi   32    Kannuaj           Phd
5    Anuj   36     Kanpur         B.com
6  Princi   27  Allahabad           Msc

In [86]:
# Results are combined back to dataframe after applying functions. 

df.groupby("Name").agg({"Age":"sum"})

        Age
Name
Abhi     32
Anuj     60
Gaurav   33
Jai      49
Princi   59